___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions.

Groupby allows you to group rows based off of a column and perform some aggregate function on them. Aggregate function is a fancy term that means that a function takes in many values and then spits out a single value such as the sum of all values or the average, etc.

In [4]:
import pandas as pd

# Create dataframe

data_dictionary = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

# list out a dictionary

In [5]:
df = pd.DataFrame(data_dictionary)

In [6]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [34]:
# you can call it as a method, and pass in the column you want to group by

df.groupby('Company')

# it will show a "groupby"-object and shows where it is stored in memory

You can save this object as a new variable:

In [7]:
by_company = df.groupby("Company")

# usually, we don't assign "df.groupby()" to a variable, we would just do it all in 1 line

And then call aggregate methods off the object:

In [8]:
by_company.mean()

# notice how the "Person" column is not here? it's because that column contains strings and you cannot take the mean of strings
# so pandas just ignores it (you cannot average "Sam" with "Charlie" and "Amy", etc.) or anything else non-numeric

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [9]:
# another way to do get the same results is:

df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

More examples of aggregate methods:

In [10]:
by_company.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [11]:
# standard deviation

by_company.std()

# notice how we get index called "Company" and column value of "Sales"

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [17]:
# that means we can index off of this

by_company.sum().loc['FB']

# this gives the sum of all sales of the company "FB"

Sales    593
Name: FB, dtype: int64

In [18]:
# without using variables, you can write something like this:

df.groupby('Company').sum().loc['FB']

# the same thing as above but will use less memory

Sales    593
Name: FB, dtype: int64

In [13]:
# notice how this time "Person" column exists? it's because Python can store things in alphabetical order 
# the max is towards the ned of the alphabet ("Sarah" is after "Carl")
by_company.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [20]:
by_company.min()

# you will see "Carl" is in front of "Sarah" in the alphabet, and therefore is the "minimum"
# but it's best to not use ".min()" or ".max()" with a string column

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [19]:
# repeating the data frame for visual 

df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [14]:
# counts the number of instances by the column

by_company.count()

# this time, "Person" column returned because each company as two sales representatives (Google has Sam + Charlie, etc.)

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [15]:
by_company.describe()

# it gives a bunch of useful information at once
# it will give count, mean, standard deviation, min, max, quartile values
# if you don't like this formatting, you can ".transpose()" this

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [43]:
# if you prefer each company to be a column instead of a row

by_comp.describe().transpose()

Company    FB                                                         GOOG  \
        count   mean        std    min     25%    50%     75%    max count
Sales     2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0   2.0

Company         ...                  MSFT                                   \
          mean  ...      75%    max count   mean         std    min    25%
Sales    160.0  ...    180.0  200.0   2.0  232.0  152.735065  124.0  178.0

Company
           50%    75%    max
Sales    232.0  286.0  340.0

[1 rows x 24 columns]

In [16]:
by_company.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

# Great Job!